# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.

# Пример:

# - для k = 8 список будет выглядеть так: 
# [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] 

len = int(input('Введите положительное число элементов списка Фибоначи '))
len1 = abs(len)

if len1!=0:
    fibo = [0]*(len1*2 + 1)

    fibo[len1 + 1] = 1
    fibo[len1 - 1] = 1

    for i in range(2, len1 + 1):
        fibo[len1 + i] = fibo[len1 + i - 2] + fibo[len1 + i - 1]
        fibo[len1 - i] = fibo[len1 - i + 2] - fibo[len1 - i + 1]
else: fibo = 0
print(fibo)

